content_org/posts.org
#+HUGO_BASE_DIR: ../
#+EXPORT_DATE:
#+OPTIONS:  ^:nil
#+HUGO_SECTION: post/
#+HUGO_AUTO_SET_LASTMOD: t
#+DATE: 2012-07-15

** DONE Packages in Python for CEC'2019 100 Digit Competition
   CLOSED: [2018-12-14 Fri 12:11]
   :PROPERTIES:
   :EXPORT_HUGO_TAGS: computer_science python
   :EXPORT_FILE_NAME: cec2019comp100digit
   :END:

I usually design my evolutionary algorithms in Python (initially for
prototyping, but I am too lazy for doing later a version in C/C++ or similar).
However, unfortunately, the majority of people in my area work in Matlab :sob:.
Thus, sometimes I have to wrap the source code for the benchmarks in competition
to python :relaxed:.

This is the story of the my new package at PyPi:
[[https://pypi.org/project/cec2019comp100digit/]].

This package is for being able to participate in the [[http://cec2019.org/programs/competitions.html#cec-06][CEC'2019 100-Digit Challenge
Competition]], website here:
http://www.ntu.edu.sg/home/epnsugan/index_files/CEC2019/CEC2019.htm.
That website was the source code in C/C++ and Matlab (using mex), but it was
missing Python. This package solves it.

As usual, the complete source code is [[https://github.com/dmolina/cec2019comp100digit][available at Github]].

In the package Pypi page there is [[https://pypi.org/project/cec2019comp100digit/][more documentation]], but in the following I
briefly describe the API:

The package is very simple to use. There is a package cec2019comp100digit with
three functions:

- *init(fun_id, Dim)*
  Init the function for the dimension selected.

- *eval(sol)*
  Eval the solution, when sol is a numpy (or array) of dimension *Dim*.

- *end()*
  Free resources.

*** Installation

It as simple as:

#+BEGIN_SRC sh
pip install cec2019comp100digit
#+END_SRC

Requirements:

- Python3.
- Numpy.
- Cython.

*** Process

- For init the function.

  #+BEGIN_SRC python
  from cec2019comp100digit import cec2019comp100digit
  bench = cec2019comp100digit
  bench.init(3, 10) # Init function 3 with dimension 10
  #+END_SRC

- To create one or several solutions to eval

  It can be used both numpy and/or array (but only numpy has been actually
  tested).

  #+BEGIN_SRC python
  import numpy as np
  sol = np.random.rand(10)
  #+END_SRC

- Evaluate the solution

  It is as simple as:

  #+BEGIN_SRC python
  fit = bench.eval(sol)
  #+END_SRC

- Finally, for free the resources

  #+BEGIN_SRC python
  bench.end()
  #+END_SRC

You can also use it for participate in the competition.

I would like to take this opportunity to remind you that I too am organising
[[https://dmolina.github.io/en/post/lsgo_cec2019/][another competition]], you do not any excuse :smile:.

